# IS 362 Week 9 Project 3

Your assignment involves combining information from a number of SQL tables, then displaying the information in a pandas DataFrame.
For your relational database management system, you may use any RDBMS, including MySQL, PostgreSQL, sqlite, or any of the other RDMBSs supported by the database in Step 1 below.
1. For your database, you should download and install the appropriate version of the Chinook database for your RDBMS, which is available here, under the downloads tab: https://chinookdatabase.codeplex.com/
2. Your task is to create a pandas DataFrame that displays Customers’ Last Name and First Name, and each customer’s purchased Track names and Album Titles. The information should be sorted by Customer LastName then Customer FirstName. The first five rows of your results should look like this:

I will begin by import the modules needed to complete this assigments tasks.

In [1]:
import pandas as pd
import numpy as np
import sqlite3

Now I can connect to the data base that I will be using in this assignment.

In [2]:
con = sqlite3.connect("C:/Users/johnj/IS 362 Spring 2018/ChinookDatabase/sourceCode/chinookdatabase/ChinookDatabase/DataSources/Chinook_Sqlite.sqlite")

Now I can create the query that will fulfill the requirements of the assignment.

In [5]:
sql = '''SELECT Customer.LastName, Customer.FirstName, Track.Name, Album.Title
         FROM Customer
         LEFT JOIN Invoice
         ON Customer.CustomerId = Invoice.CustomerId
         LEFT JOIN InvoiceLine
         ON Invoice.InvoiceId = InvoiceLine.InvoiceId
         LEFT JOIN Track
         ON InvoiceLine.TrackId = Track.TrackId
         LEFT JOIN Album
         ON Track.AlbumId = Album.AlbumId
         ORDER BY Customer.LastName, Customer.FirstName'''

Now that the database is connected and the query has been written I can use pandas to put the data into a dataframe.

In [6]:
pd.read_sql_query(sql , con=con).head()

,LastName,FirstName,Name,Title
0,Almeida,Roberto,Right Next Door to Hell,Use Your Illusion I
1,Almeida,Roberto,In The Evening,In Through The Out Door
2,Almeida,Roberto,Fool In The Rain,In Through The Out Door
3,Almeida,Roberto,Saudade Dos Aviões Da Panair (Conversando No Bar),Minas
4,Almeida,Roberto,Caso Você Queira Saber,Minas